### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-17T20:18:55.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:37",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:31" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:31/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.zip" -> "lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.zip"
!       s3_object_version              = "hYjLw9FnvDqis9XqCwXPSiSas4dgNKr." -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "31" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "31" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "baaba6671f40f0cb937f807cf25c389a" -> (known after apply)
!       id                     = "lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.zip" -> (known after apply)
!       key                    = "lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.zip" -> "lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.zip" -> "./.terraform/lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "hYjLw9FnvDqis9XqCwXPSiSas4dgNKr." -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "set:filter",
+                       [
+                           "!app/.*",
                        ],
                    ],
+                   [
+                       "zip",
+                       "./app",
+                       null,
                    ],
+                   [
+                       "clear:filter",
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "3031853586698601427" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.zip" -> "./.terraform/lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.zip"
!           "timestamp" = "1692303320958134000" -> "1692304147363311000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "2149996048084320268" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/70448fb6479d32250b8190420de451e3f7a562040adc1980a346e6875e26f93b.zip" -> "./.terraform/lambda-builds/c996be15657c25c47858dd01596064e6a7b99a860f571c18194c2dec2d14b17f.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:37" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-17T20:18:55.230+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:37" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/5b08ace2f29f3a456ec527e3da2698924b23409f3a54f80d25f8d82df3fc2890.zip" -> "builds/88bb391aa573a15d648e57df28a91d2f51e9255dceee3314e3ec6f2c84c9ecba.zip"
!       s3_object_version           = "_Jw8mMwHCLo4aO3usz2qNt1Zh0fwi1_F" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "WvsfuSHULWDcW4PRhw4WNjG1I5LdXyeKNOdFr0G3QHo=" -> (known after apply)
!       source_code_size            = 29717515 -> (known after apply)
!       version                     = "37" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "6d31eaf67c1f03cfb4eb571016d11a20-6" -> (known after apply)
!       id                     = "builds/5b08ace2f29f3a456ec527e3da2698924b23409f3a54f80d25f8d82df3fc2890.zip" -> (known after apply)
!       key                    = "builds/5b08ace2f29f3a456ec527e3da2698924b23409f3a54f80d25f8d82df3fc2890.zip" -> "builds/88bb391aa573a15d648e57df28a91d2f51e9255dceee3314e3ec6f2c84c9ecba.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/5b08ace2f29f3a456ec527e3da2698924b23409f3a54f80d25f8d82df3fc2890.zip" -> "builds/88bb391aa573a15d648e57df28a91d2f51e9255dceee3314e3ec6f2c84c9ecba.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "_Jw8mMwHCLo4aO3usz2qNt1Zh0fwi1_F" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/88bb391aa573a15d648e57df28a91d2f51e9255dceee3314e3ec6f2c84c9ecba.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/88bb391aa573a15d648e57df28a91d2f51e9255dceee3314e3ec6f2c84c9ecba.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "6511765223301442305" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/5b08ace2f29f3a456ec527e3da2698924b23409f3a54f80d25f8d82df3fc2890.zip" -> "builds/88bb391aa573a15d648e57df28a91d2f51e9255dceee3314e3ec6f2c84c9ecba.zip"
!           "timestamp" = "1692303322518024000" -> "1692304149433554800"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "5392405364203700557" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/5b08ace2f29f3a456ec527e3da2698924b23409f3a54f80d25f8d82df3fc2890.zip" -> "builds/88bb391aa573a15d648e57df28a91d2f51e9255dceee3314e3ec6f2c84c9ecba.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>